package com.homework.variables1;

/**
 *
 УсловиеДерево классов

 Используя только оператор декремента, измени значение переменной toothCounter, чтобы на экран вывелось число 23.
 Требования:
 •	Не изменяй команду объявления переменной toothCounter.
 •	К переменной toothCounter нужно применить несколько команд декремента, чтобы она изменила значение на 23.
 •	Программа должна выводить на экран переменную toothCounter со значением 23.
 */

public class Variable4 {

  public static void main(String[] args) {
    // объявляем переменную toothCounter типа int и сразу же в строке
    // объявления присваиваем ей значение 32
    int toothCounter = 32;

    // выполняем операцию декремента (уменьшаем) значение переменной
    // toothCounter на 1 с помощью оператора декремента --
    toothCounter--;
    // выполняем операцию декремента (уменьшаем) значение переменной
    // toothCounter на 1 с помощью оператора декремента --
    toothCounter--;
    // выполняем операцию декремента (уменьшаем) значение переменной
    // toothCounter на 1 с помощью оператора декремента --
    toothCounter--;
    // выполняем операцию декремента (уменьшаем) значение переменной
    // toothCounter на 1 с помощью оператора декремента --
    toothCounter--;
    // выполняем операцию декремента (уменьшаем) значение переменной
    // toothCounter на 1 с помощью оператора декремента --
    toothCounter--;
    // выполняем операцию декремента (уменьшаем) значение переменной
    // toothCounter на 1 с помощью оператора декремента --
    toothCounter--;
    // выполняем операцию декремента (уменьшаем) значение переменной
    // toothCounter на 1 с помощью оператора декремента --
    toothCounter--;
    // выполняем операцию декремента (уменьшаем) значение переменной
    // toothCounter на 1 с помощью оператора декремента --
    toothCounter--;
    // выполняем операцию декремента (уменьшаем) значение переменной
    // toothCounter на 1 с помощью оператора декремента --
    toothCounter--;

    // выводим на экран значение переменной toothCounter
    System.out.println(toothCounter);
  }
}
