package com.homework.variables1;

/**
 *
 УсловиеДерево классов

 В методе main объяви переменные word, phrase, line и text типа String.
 Присвой им разные значения. Используй одну команду для создания и инициализации переменных.
 Значениями могут быть любые строки.
 Требования:
 •	В методе main объяви четыре переменные типа String.
 •	Назови переменные именами word, phrase, line и text.
 •	Переменным сразу присвой значения.
 •	У всех переменных должны быть разные значения.
 */

public class Variable5 {

  public static void main(String[] args) {
    // объявляем переменную word типа String и присваиваем ей значение
    String word = "Никто не скажет, верно ты поступил или нет, пока не столкнешься с последствиями.";
    // объявляем переменную phrase типа String и присваиваем ей значение
    String phrase = "Когда людей окутывает тьма, они начинают видеть свет.";
    // объявляем переменную line типа String и присваиваем ей значение
    String line = "Тому, кто сражается с монстрами, стоит следить, чтобы он сам не стал монстром.";
    // объявляем переменную text типа String и присваиваем ей значение
    String text = "Человеческие чувства предназначены для того, чтобы откликаться на чувства других людей.";
  }
}
