package com.homework.variables1;

/**
 * В методе main объяви переменные intValue, numericValue, size, number типа int.
 * Присвой им разные значения. Используй одну команду для создания и инициализации переменных.
 * Значениями могут быть любые целые числа.
 * Требования:
 * •	В методе main объяви четыре переменные типа int.
 * •	Имена переменных должны быть intValue, numericValue, size и number.
 * •	Переменным сразу должны быть присвоены значения.
 * •	Все переменные должны иметь разные значения.
 */

public class Variable1 {

  public static void main(String[] args) {
    // объявляем переменную intValue типа int и сразу же в строке объявления
    // присваиваем ей значение 1
    int intValue = 1;
    // объявляем переменную numericValue типа int и сразу же в строке
    // объявления присваиваем ей значение 17
    int numericValue = 17;
    // объявляем переменную size типа int и сразу же в строке объявления
    // присваиваем ей значение 8
    int size = 8;
    // объявляем переменную number типа int и сразу же в строке объявления
    // присваиваем ей значение 22
    int number = 22;
  }
}
